#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

print("Введите 2 числа")

x = int(input())
y = int(input())

print("Сумма чисел равна:", x+y)

print("Разность чисел равна:", x-y)

print("Частное чисел равно:", x/y)

print("Произведение чисел равно:", x*y)

print("Результат целочисленного деления равен:", x//y)

print("Результат деления с остатком равен:", x%y)

print("Результат возведения в степень равен:",x**y)
