#todo: Определить в коде  переменные:

#1. Целочисленного типа
#2. Вещественного типа
#3. Логического типа
#4. Строкового типа
#5. Пустого типа

#Вывести все их типы.

a = 10
b = 14.7
c = True
d = "Hello world"
e = None

print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))
